title: HTTP Request With Empty User Agent
id: 21e44d78-95e7-421b-a464-ffd8395659c4
status: test
description: |
    Detects a potentially suspicious empty user agent strings in proxy log.
    Could potentially indicate an uncommon request method.
references:
    - https://twitter.com/Carlos_Perez/status/883455096645931008
author: Florian Roth (Nextron Systems)
date: 2017-07-08
modified: 2021-11-27
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1071.001
    - attack.t1080
    - attack.t1205
    - attack.t1205.001
    - attack.t1205.002
    - attack.t1491
    - attack.t1491.002
    - attack.t1497
    - attack.t1497.003
    - attack.t1534
    - attack.t1538
    - attack.t1542
    - attack.t1542.002
    - attack.t1542.004
    - attack.t1542.005
    - attack.t1561
    - attack.t1583
    - attack.t1583.001
    - attack.t1583.002
    - attack.t1583.003
    - attack.t1583.004
    - attack.t1583.005
    - attack.t1583.006
    - attack.t1583.007
    - attack.t1583.008
    - attack.t1596
    - attack.t1596.001
    - attack.t1596.002
    - attack.t1596.003
    - attack.t1596.004
    - attack.t1596.005
    - attack.t1601
    - attack.t1601.001
    - attack.t1601.002
    - attack.t1610
    - attack.t1612
    - attack.t1613
    - attack.t1656
    - attack.t1657
    - attack.t1659
    - attack.t1665
    - attack.t1669
logsource:
    category: proxy
detection:
    selection:
      # Empty string - as used by Powershell's (New-Object Net.WebClient).DownloadString
        c-useragent: ''
    condition: selection
falsepositives:
    - Unknown
level: medium
